ETL/DataProcessors/ЗагрузкаСтруктурыКонфигурации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаСтруктурыКонфигурации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьТолькоНовыеОбъектыСвойстваЗначения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ETL/DataProcessors/ЗагрузкаСтруктурыКонфигурации/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьЗагрузку() Экспорт
	
	СтруктураПараметров = Новый Структура("СпособЗагрузки, ИмяФайлаЗагрузки", ?(ЗначениеЗаполнено(ЭтотОбъект.Конфигурация), 1, 0), ЭтотОбъект.ИмяФайлаЗагрузки);
	СтруктураПараметров.Вставить("Конфигурация", ЭтотОбъект.Конфигурация);
	СтруктураПараметров.Вставить("ДобавлятьТолькоНовые", ЭтотОбъект.ДобавлятьТолькоНовыеОбъектыСвойстваЗначения);
	
	Адрес = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	Обработки.ЗагрузкаСтруктурыКонфигурации.ВыполнитьЗагрузкуМетаданных(СтруктураПараметров, Адрес);
		
КонецПроцедуры

#КонецОбласти
